zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/hsusbh_reg.h
#define HSUSBH_UIENR_USBIEN_Pos          (0)                                               /*!< HSUSBH_T::UIENR: USBIEN Position       */
#define HSUSBH_UIENR_USBIEN_Msk          (0x1ul << HSUSBH_UIENR_USBIEN_Pos)                /*!< HSUSBH_T::UIENR: USBIEN Mask           */

#define HSUSBH_UIENR_UERRIEN_Pos         (1)                                               /*!< HSUSBH_T::UIENR: UERRIEN Position      */
#define HSUSBH_UIENR_UERRIEN_Msk         (0x1ul << HSUSBH_UIENR_UERRIEN_Pos)               /*!< HSUSBH_T::UIENR: UERRIEN Mask          */

#define HSUSBH_UIENR_PCIEN_Pos           (2)                                               /*!< HSUSBH_T::UIENR: PCIEN Position        */
#define HSUSBH_UIENR_PCIEN_Msk           (0x1ul << HSUSBH_UIENR_PCIEN_Pos)                 /*!< HSUSBH_T::UIENR: PCIEN Mask            */

#define HSUSBH_UIENR_FLREN_Pos           (3)                                               /*!< HSUSBH_T::UIENR: FLREN Position        */
#define HSUSBH_UIENR_FLREN_Msk           (0x1ul << HSUSBH_UIENR_FLREN_Pos)                 /*!< HSUSBH_T::UIENR: FLREN Mask            */

#define HSUSBH_UIENR_HSERREN_Pos         (4)                                               /*!< HSUSBH_T::UIENR: HSERREN Position      */
#define HSUSBH_UIENR_HSERREN_Msk         (0x1ul << HSUSBH_UIENR_HSERREN_Pos)               /*!< HSUSBH_T::UIENR: HSERREN Mask          */

#define HSUSBH_UIENR_IAAEN_Pos           (5)                                               /*!< HSUSBH_T::UIENR: IAAEN Position        */
#define HSUSBH_UIENR_IAAEN_Msk           (0x1ul << HSUSBH_UIENR_IAAEN_Pos)                 /*!< HSUSBH_T::UIENR: IAAEN Mask            */

#define HSUSBH_UFINDR_FI_Pos             (0)                                               /*!< HSUSBH_T::UFINDR: FI Position          */
#define HSUSBH_UFINDR_FI_Msk             (0x3ffful << HSUSBH_UFINDR_FI_Pos)                /*!< HSUSBH_T::UFINDR: FI Mask              */

#define HSUSBH_UPFLBAR_BADDR_Pos         (12)                                              /*!< HSUSBH_T::UPFLBAR: BADDR Position      */
#define HSUSBH_UPFLBAR_BADDR_Msk         (0xffffful << HSUSBH_UPFLBAR_BADDR_Pos)           /*!< HSUSBH_T::UPFLBAR: BADDR Mask          */

#define HSUSBH_UCALAR_LPL_Pos            (5)                                               /*!< HSUSBH_T::UCALAR: LPL Position         */
#define HSUSBH_UCALAR_LPL_Msk            (0x7fffffful << HSUSBH_UCALAR_LPL_Pos)            /*!< HSUSBH_T::UCALAR: LPL Mask             */

#define HSUSBH_UCFGR_CF_Pos              (0)                                               /*!< HSUSBH_T::UCFGR: CF Position           */
#define HSUSBH_UCFGR_CF_Msk              (0x1ul << HSUSBH_UCFGR_CF_Pos)                    /*!< HSUSBH_T::UCFGR: CF Mask               */

#define HSUSBH_UPSCR_CCS_Pos             (0)                                               /*!< HSUSBH_T::UPSCR: CCS Position          */
#define HSUSBH_UPSCR_CCS_Msk             (0x1ul << HSUSBH_UPSCR_CCS_Pos)                   /*!< HSUSBH_T::UPSCR: CCS Mask              */

#define HSUSBH_UPSCR_CSC_Pos             (1)                                               /*!< HSUSBH_T::UPSCR: CSC Position          */
#define HSUSBH_UPSCR_CSC_Msk             (0x1ul << HSUSBH_UPSCR_CSC_Pos)                   /*!< HSUSBH_T::UPSCR: CSC Mask              */

#define HSUSBH_UPSCR_PE_Pos              (2)                                               /*!< HSUSBH_T::UPSCR: PE Position           */
#define HSUSBH_UPSCR_PE_Msk              (0x1ul << HSUSBH_UPSCR_PE_Pos)                    /*!< HSUSBH_T::UPSCR: PE Mask               */

#define HSUSBH_UPSCR_PEC_Pos             (3)                                               /*!< HSUSBH_T::UPSCR: PEC Position          */
#define HSUSBH_UPSCR_PEC_Msk             (0x1ul << HSUSBH_UPSCR_PEC_Pos)                   /*!< HSUSBH_T::UPSCR: PEC Mask              */

#define HSUSBH_UPSCR_OCA_Pos             (4)                                               /*!< HSUSBH_T::UPSCR: OCA Position          */
#define HSUSBH_UPSCR_OCA_Msk             (0x1ul << HSUSBH_UPSCR_OCA_Pos)                   /*!< HSUSBH_T::UPSCR: OCA Mask              */

#define HSUSBH_UPSCR_OCC_Pos             (5)                                               /*!< HSUSBH_T::UPSCR: OCC Position          */
#define HSUSBH_UPSCR_OCC_Msk             (0x1ul << HSUSBH_UPSCR_OCC_Pos)                   /*!< HSUSBH_T::UPSCR: OCC Mask              */

#define HSUSBH_UPSCR_FPR_Pos             (6)                                               /*!< HSUSBH_T::UPSCR: FPR Position          */
#define HSUSBH_UPSCR_FPR_Msk             (0x1ul << HSUSBH_UPSCR_FPR_Pos)                   /*!< HSUSBH_T::UPSCR: FPR Mask              */

#define HSUSBH_UPSCR_SUSPEND_Pos         (7)                                               /*!< HSUSBH_T::UPSCR: SUSPEND Position      */
#define HSUSBH_UPSCR_SUSPEND_Msk         (0x1ul << HSUSBH_UPSCR_SUSPEND_Pos)               /*!< HSUSBH_T::UPSCR: SUSPEND Mask          */

#define HSUSBH_UPSCR_PRST_Pos            (8)                                               /*!< HSUSBH_T::UPSCR: PRST Position         */
#define HSUSBH_UPSCR_PRST_Msk            (0x1ul << HSUSBH_UPSCR_PRST_Pos)                  /*!< HSUSBH_T::UPSCR: PRST Mask             */

#define HSUSBH_UPSCR_LSTS_Pos            (10)                                              /*!< HSUSBH_T::UPSCR: LSTS Position         */
#define HSUSBH_UPSCR_LSTS_Msk            (0x3ul << HSUSBH_UPSCR_LSTS_Pos)                  /*!< HSUSBH_T::UPSCR: LSTS Mask             */

#define HSUSBH_UPSCR_PP_Pos              (12)                                              /*!< HSUSBH_T::UPSCR: PP Position           */
#define HSUSBH_UPSCR_PP_Msk              (0x1ul << HSUSBH_UPSCR_PP_Pos)                    /*!< HSUSBH_T::UPSCR: PP Mask               */

#define HSUSBH_UPSCR_PO_Pos              (13)                                              /*!< HSUSBH_T::UPSCR: PO Position           */
#define HSUSBH_UPSCR_PO_Msk              (0x1ul << HSUSBH_UPSCR_PO_Pos)                    /*!< HSUSBH_T::UPSCR: PO Mask               */

#define HSUSBH_UPSCR_PTC_Pos             (16)                                              /*!< HSUSBH_T::UPSCR: PTC Position          */
#define HSUSBH_UPSCR_PTC_Msk             (0xful << HSUSBH_UPSCR_PTC_Pos)                   /*!< HSUSBH_T::UPSCR: PTC Mask              */


#define USBH1_HcRevision_REV_Pos         (0)                                               /*!< USBH1_T::HcRevision: REV Position      */
#define USBH1_HcRevision_REV_Msk         (0xfful << USBH1_HcRevision_REV_Pos)              /*!< USBH1_T::HcRevision: REV Mask          */

#define USBH1_HcControl_CBSR_Pos         (0)                                               /*!< USBH1_T::HcControl: CBSR Position      */
#define USBH1_HcControl_CBSR_Msk         (0x3ul << USBH1_HcControl_CBSR_Pos)               /*!< USBH1_T::HcControl: CBSR Mask          */

#define USBH1_HcControl_PLE_Pos          (2)                                               /*!< USBH1_T::HcControl: PLE Position       */
#define USBH1_HcControl_PLE_Msk          (0x1ul << USBH1_HcControl_PLE_Pos)                /*!< USBH1_T::HcControl: PLE Mask           */

#define USBH1_HcControl_IE_Pos           (3)                                               /*!< USBH1_T::HcControl: IE Position        */
#define USBH1_HcControl_IE_Msk           (0x1ul << USBH1_HcControl_IE_Pos)                 /*!< USBH1_T::HcControl: IE Mask            */

#define USBH1_HcControl_CLE_Pos          (4)                                               /*!< USBH1_T::HcControl: CLE Position       */
#define USBH1_HcControl_CLE_Msk          (0x1ul << USBH1_HcControl_CLE_Pos)                /*!< USBH1_T::HcControl: CLE Mask           */

#define USBH1_HcControl_BLE_Pos          (5)                                               /*!< USBH1_T::HcControl: BLE Position       */
#define USBH1_HcControl_BLE_Msk          (0x1ul << USBH1_HcControl_BLE_Pos)                /*!< USBH1_T::HcControl: BLE Mask           */

#define USBH1_HcControl_HCFS_Pos         (6)                                               /*!< USBH1_T::HcControl: HCFS Position      */
#define USBH1_HcControl_HCFS_Msk         (0x3ul << USBH1_HcControl_HCFS_Pos)               /*!< USBH1_T::HcControl: HCFS Mask          */

#define USBH1_HcCommandStatus_HCR_Pos    (0)                                               /*!< USBH1_T::HcCommandStatus: HCR Position */
#define USBH1_HcCommandStatus_HCR_Msk    (0x1ul << USBH1_HcCommandStatus_HCR_Pos)          /*!< USBH1_T::HcCommandStatus: HCR Mask     */

#define USBH1_HcCommandStatus_CLF_Pos    (1)                                               /*!< USBH1_T::HcCommandStatus: CLF Position */
#define USBH1_HcCommandStatus_CLF_Msk    (0x1ul << USBH1_HcCommandStatus_CLF_Pos)          /*!< USBH1_T::HcCommandStatus: CLF Mask     */

