zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/hsusbh_reg.h
#define USBH1_HcCommandStatus_BLF_Pos    (2)                                               /*!< USBH1_T::HcCommandStatus: BLF Position */
#define USBH1_HcCommandStatus_BLF_Msk    (0x1ul << USBH1_HcCommandStatus_BLF_Pos)          /*!< USBH1_T::HcCommandStatus: BLF Mask     */

#define USBH1_HcCommandStatus_SOC_Pos    (16)                                              /*!< USBH1_T::HcCommandStatus: SOC Position */
#define USBH1_HcCommandStatus_SOC_Msk    (0x3ul << USBH1_HcCommandStatus_SOC_Pos)          /*!< USBH1_T::HcCommandStatus: SOC Mask     */

#define USBH1_HcInterruptStatus_SO_Pos   (0)                                               /*!< USBH1_T::HcInterruptStatus: SO Position*/
#define USBH1_HcInterruptStatus_SO_Msk   (0x1ul << USBH1_HcInterruptStatus_SO_Pos)         /*!< USBH1_T::HcInterruptStatus: SO Mask    */

#define USBH1_HcInterruptStatus_WDH_Pos  (1)                                               /*!< USBH1_T::HcInterruptStatus: WDH Position*/
#define USBH1_HcInterruptStatus_WDH_Msk  (0x1ul << USBH1_HcInterruptStatus_WDH_Pos)        /*!< USBH1_T::HcInterruptStatus: WDH Mask   */

#define USBH1_HcInterruptStatus_SF_Pos   (2)                                               /*!< USBH1_T::HcInterruptStatus: SF Position*/
#define USBH1_HcInterruptStatus_SF_Msk   (0x1ul << USBH1_HcInterruptStatus_SF_Pos)         /*!< USBH1_T::HcInterruptStatus: SF Mask    */

#define USBH1_HcInterruptStatus_RD_Pos   (3)                                               /*!< USBH1_T::HcInterruptStatus: RD Position*/
#define USBH1_HcInterruptStatus_RD_Msk   (0x1ul << USBH1_HcInterruptStatus_RD_Pos)         /*!< USBH1_T::HcInterruptStatus: RD Mask    */

#define USBH1_HcInterruptStatus_FNO_Pos  (5)                                               /*!< USBH1_T::HcInterruptStatus: FNO Position*/
#define USBH1_HcInterruptStatus_FNO_Msk  (0x1ul << USBH1_HcInterruptStatus_FNO_Pos)        /*!< USBH1_T::HcInterruptStatus: FNO Mask   */

#define USBH1_HcInterruptStatus_RHSC_Pos (6)                                               /*!< USBH1_T::HcInterruptStatus: RHSC Position*/
#define USBH1_HcInterruptStatus_RHSC_Msk (0x1ul << USBH1_HcInterruptStatus_RHSC_Pos)       /*!< USBH1_T::HcInterruptStatus: RHSC Mask  */

#define USBH1_HcInterruptEnable_SO_Pos   (0)                                               /*!< USBH1_T::HcInterruptEnable: SO Position*/
#define USBH1_HcInterruptEnable_SO_Msk   (0x1ul << USBH1_HcInterruptEnable_SO_Pos)         /*!< USBH1_T::HcInterruptEnable: SO Mask    */

#define USBH1_HcInterruptEnable_WDH_Pos  (1)                                               /*!< USBH1_T::HcInterruptEnable: WDH Position*/
#define USBH1_HcInterruptEnable_WDH_Msk  (0x1ul << USBH1_HcInterruptEnable_WDH_Pos)        /*!< USBH1_T::HcInterruptEnable: WDH Mask   */

#define USBH1_HcInterruptEnable_SF_Pos   (2)                                               /*!< USBH1_T::HcInterruptEnable: SF Position*/
#define USBH1_HcInterruptEnable_SF_Msk   (0x1ul << USBH1_HcInterruptEnable_SF_Pos)         /*!< USBH1_T::HcInterruptEnable: SF Mask    */

#define USBH1_HcInterruptEnable_RD_Pos   (3)                                               /*!< USBH1_T::HcInterruptEnable: RD Position*/
#define USBH1_HcInterruptEnable_RD_Msk   (0x1ul << USBH1_HcInterruptEnable_RD_Pos)         /*!< USBH1_T::HcInterruptEnable: RD Mask    */

#define USBH1_HcInterruptEnable_FNO_Pos  (5)                                               /*!< USBH1_T::HcInterruptEnable: FNO Position*/
#define USBH1_HcInterruptEnable_FNO_Msk  (0x1ul << USBH1_HcInterruptEnable_FNO_Pos)        /*!< USBH1_T::HcInterruptEnable: FNO Mask   */

#define USBH1_HcInterruptEnable_RHSC_Pos (6)                                               /*!< USBH1_T::HcInterruptEnable: RHSC Position*/
#define USBH1_HcInterruptEnable_RHSC_Msk (0x1ul << USBH1_HcInterruptEnable_RHSC_Pos)       /*!< USBH1_T::HcInterruptEnable: RHSC Mask  */

#define USBH1_HcInterruptEnable_MIE_Pos  (31)                                              /*!< USBH1_T::HcInterruptEnable: MIE Position*/
#define USBH1_HcInterruptEnable_MIE_Msk  (0x1ul << USBH1_HcInterruptEnable_MIE_Pos)        /*!< USBH1_T::HcInterruptEnable: MIE Mask   */

#define USBH1_HcInterruptDisable_SO_Pos  (0)                                               /*!< USBH1_T::HcInterruptDisable: SO Position*/
#define USBH1_HcInterruptDisable_SO_Msk  (0x1ul << USBH1_HcInterruptDisable_SO_Pos)        /*!< USBH1_T::HcInterruptDisable: SO Mask   */

#define USBH1_HcInterruptDisable_WDH_Pos (1)                                               /*!< USBH1_T::HcInterruptDisable: WDH Position*/
#define USBH1_HcInterruptDisable_WDH_Msk (0x1ul << USBH1_HcInterruptDisable_WDH_Pos)       /*!< USBH1_T::HcInterruptDisable: WDH Mask  */

#define USBH1_HcInterruptDisable_SF_Pos  (2)                                               /*!< USBH1_T::HcInterruptDisable: SF Position*/
#define USBH1_HcInterruptDisable_SF_Msk  (0x1ul << USBH1_HcInterruptDisable_SF_Pos)        /*!< USBH1_T::HcInterruptDisable: SF Mask   */

#define USBH1_HcInterruptDisable_RD_Pos  (3)                                               /*!< USBH1_T::HcInterruptDisable: RD Position*/
#define USBH1_HcInterruptDisable_RD_Msk  (0x1ul << USBH1_HcInterruptDisable_RD_Pos)        /*!< USBH1_T::HcInterruptDisable: RD Mask   */

#define USBH1_HcInterruptDisable_FNO_Pos (5)                                               /*!< USBH1_T::HcInterruptDisable: FNO Position*/
#define USBH1_HcInterruptDisable_FNO_Msk (0x1ul << USBH1_HcInterruptDisable_FNO_Pos)       /*!< USBH1_T::HcInterruptDisable: FNO Mask  */

#define USBH1_HcInterruptDisable_RHSC_Pos (6)                                              /*!< USBH1_T::HcInterruptDisable: RHSC Position*/
#define USBH1_HcInterruptDisable_RHSC_Msk (0x1ul << USBH1_HcInterruptDisable_RHSC_Pos)     /*!< USBH1_T::HcInterruptDisable: RHSC Mask */

#define USBH1_HcInterruptDisable_MIE_Pos (31)                                              /*!< USBH1_T::HcInterruptDisable: MIE Position*/
#define USBH1_HcInterruptDisable_MIE_Msk (0x1ul << USBH1_HcInterruptDisable_MIE_Pos)       /*!< USBH1_T::HcInterruptDisable: MIE Mask  */

#define USBH1_HcHCCA_HCCA_Pos            (8)                                               /*!< USBH1_T::HcHCCA: HCCA Position         */
#define USBH1_HcHCCA_HCCA_Msk            (0xfffffful << USBH1_HcHCCA_HCCA_Pos)             /*!< USBH1_T::HcHCCA: HCCA Mask             */

#define USBH1_HcPeriodCurrentED_PCED_Pos (4)                                               /*!< USBH1_T::HcPeriodCurrentED: PCED Position*/
#define USBH1_HcPeriodCurrentED_PCED_Msk (0xffffffful << USBH1_HcPeriodCurrentED_PCED_Pos) /*!< USBH1_T::HcPeriodCurrentED: PCED Mask  */

