zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/hsusbh_reg.h
#define USBH1_HcControlHeadED_CHED_Pos   (4)                                               /*!< USBH1_T::HcControlHeadED: CHED Position*/
#define USBH1_HcControlHeadED_CHED_Msk   (0xffffffful << USBH1_HcControlHeadED_CHED_Pos)   /*!< USBH1_T::HcControlHeadED: CHED Mask    */

#define USBH1_HcControlCurrentED_CCED_Pos (4)                                              /*!< USBH1_T::HcControlCurrentED: CCED Position*/
#define USBH1_HcControlCurrentED_CCED_Msk (0xffffffful << USBH1_HcControlCurrentED_CCED_Pos) /*!< USBH1_T::HcControlCurrentED: CCED Mask */

#define USBH1_HcBulkHeadED_BHED_Pos      (4)                                               /*!< USBH1_T::HcBulkHeadED: BHED Position   */
#define USBH1_HcBulkHeadED_BHED_Msk      (0xffffffful << USBH1_HcBulkHeadED_BHED_Pos)      /*!< USBH1_T::HcBulkHeadED: BHED Mask       */

#define USBH1_HcBulkCurrentED_BCED_Pos   (4)                                               /*!< USBH1_T::HcBulkCurrentED: BCED Position*/
#define USBH1_HcBulkCurrentED_BCED_Msk   (0xffffffful << USBH1_HcBulkCurrentED_BCED_Pos)   /*!< USBH1_T::HcBulkCurrentED: BCED Mask    */

#define USBH1_HcDoneHead_DH_Pos          (4)                                               /*!< USBH1_T::HcDoneHead: DH Position       */
#define USBH1_HcDoneHead_DH_Msk          (0xffffffful << USBH1_HcDoneHead_DH_Pos)          /*!< USBH1_T::HcDoneHead: DH Mask           */

#define USBH1_HcFmInterval_FI_Pos        (0)                                               /*!< USBH1_T::HcFmInterval: FI Position     */
#define USBH1_HcFmInterval_FI_Msk        (0x3ffful << USBH1_HcFmInterval_FI_Pos)           /*!< USBH1_T::HcFmInterval: FI Mask         */

#define USBH1_HcFmInterval_FSMPS_Pos     (16)                                              /*!< USBH1_T::HcFmInterval: FSMPS Position  */
#define USBH1_HcFmInterval_FSMPS_Msk     (0x3ffful << USBH1_HcFmInterval_FSMPS_Pos)        /*!< USBH1_T::HcFmInterval: FSMPS Mask      */

#define USBH1_HcFmInterval_FIT_Pos       (31)                                              /*!< USBH1_T::HcFmInterval: FIT Position    */
#define USBH1_HcFmInterval_FIT_Msk       (0x1ul << USBH1_HcFmInterval_FIT_Pos)             /*!< USBH1_T::HcFmInterval: FIT Mask        */

#define USBH1_HcFmRemaining_FR_Pos       (0)                                               /*!< USBH1_T::HcFmRemaining: FR Position    */
#define USBH1_HcFmRemaining_FR_Msk       (0x3ffful << USBH1_HcFmRemaining_FR_Pos)          /*!< USBH1_T::HcFmRemaining: FR Mask        */

#define USBH1_HcFmRemaining_FRT_Pos      (31)                                              /*!< USBH1_T::HcFmRemaining: FRT Position   */
#define USBH1_HcFmRemaining_FRT_Msk      (0x1ul << USBH1_HcFmRemaining_FRT_Pos)            /*!< USBH1_T::HcFmRemaining: FRT Mask       */

#define USBH1_HcFmNumber_FN_Pos          (0)                                               /*!< USBH1_T::HcFmNumber: FN Position       */
#define USBH1_HcFmNumber_FN_Msk          (0xfffful << USBH1_HcFmNumber_FN_Pos)             /*!< USBH1_T::HcFmNumber: FN Mask           */

#define USBH1_HcPeriodicStart_PS_Pos     (0)                                               /*!< USBH1_T::HcPeriodicStart: PS Position  */
#define USBH1_HcPeriodicStart_PS_Msk     (0x3ffful << USBH1_HcPeriodicStart_PS_Pos)        /*!< USBH1_T::HcPeriodicStart: PS Mask      */

#define USBH1_HcLSThreshold_LST_Pos      (0)                                               /*!< USBH1_T::HcLSThreshold: LST Position   */
#define USBH1_HcLSThreshold_LST_Msk      (0xffful << USBH1_HcLSThreshold_LST_Pos)          /*!< USBH1_T::HcLSThreshold: LST Mask       */

#define USBH1_HcRhDescriptorA_NDP_Pos    (0)                                               /*!< USBH1_T::HcRhDescriptorA: NDP Position */
#define USBH1_HcRhDescriptorA_NDP_Msk    (0xfful << USBH1_HcRhDescriptorA_NDP_Pos)         /*!< USBH1_T::HcRhDescriptorA: NDP Mask     */

#define USBH1_HcRhDescriptorA_PSM_Pos    (8)                                               /*!< USBH1_T::HcRhDescriptorA: PSM Position */
#define USBH1_HcRhDescriptorA_PSM_Msk    (0x1ul << USBH1_HcRhDescriptorA_PSM_Pos)          /*!< USBH1_T::HcRhDescriptorA: PSM Mask     */

#define USBH1_HcRhDescriptorA_OCPM_Pos   (11)                                              /*!< USBH1_T::HcRhDescriptorA: OCPM Position*/
#define USBH1_HcRhDescriptorA_OCPM_Msk   (0x1ul << USBH1_HcRhDescriptorA_OCPM_Pos)         /*!< USBH1_T::HcRhDescriptorA: OCPM Mask    */

#define USBH1_HcRhDescriptorA_NOCP_Pos   (12)                                              /*!< USBH1_T::HcRhDescriptorA: NOCP Position*/
#define USBH1_HcRhDescriptorA_NOCP_Msk   (0x1ul << USBH1_HcRhDescriptorA_NOCP_Pos)         /*!< USBH1_T::HcRhDescriptorA: NOCP Mask    */

#define USBH1_HcRhDescriptorB_DR_Pos     (0)                                               /*!< USBH1_T::HcRhDescriptorB: DR Position  */
#define USBH1_HcRhDescriptorB_DR_Msk     (0xfffful << USBH1_HcRhDescriptorB_DR_Pos)        /*!< USBH1_T::HcRhDescriptorB: DR Mask      */

#define USBH1_HcRhDescriptorB_PPCM_Pos   (16)                                              /*!< USBH1_T::HcRhDescriptorB: PPCM Position*/
#define USBH1_HcRhDescriptorB_PPCM_Msk   (0xfffful << USBH1_HcRhDescriptorB_PPCM_Pos)      /*!< USBH1_T::HcRhDescriptorB: PPCM Mask    */

#define USBH1_HcRhStatus_LPS_Pos         (0)                                               /*!< USBH1_T::HcRhStatus: LPS Position      */
#define USBH1_HcRhStatus_LPS_Msk         (0x1ul << USBH1_HcRhStatus_LPS_Pos)               /*!< USBH1_T::HcRhStatus: LPS Mask          */

#define USBH1_HcRhStatus_OCI_Pos         (1)                                               /*!< USBH1_T::HcRhStatus: OCI Position      */
#define USBH1_HcRhStatus_OCI_Msk         (0x1ul << USBH1_HcRhStatus_OCI_Pos)               /*!< USBH1_T::HcRhStatus: OCI Mask          */

#define USBH1_HcRhStatus_DRWE_Pos        (15)                                              /*!< USBH1_T::HcRhStatus: DRWE Position     */
#define USBH1_HcRhStatus_DRWE_Msk        (0x1ul << USBH1_HcRhStatus_DRWE_Pos)              /*!< USBH1_T::HcRhStatus: DRWE Mask         */

#define USBH1_HcRhStatus_LPSC_Pos        (16)                                              /*!< USBH1_T::HcRhStatus: LPSC Position     */
#define USBH1_HcRhStatus_LPSC_Msk        (0x1ul << USBH1_HcRhStatus_LPSC_Pos)              /*!< USBH1_T::HcRhStatus: LPSC Mask         */

#define USBH1_HcRhStatus_OCIC_Pos        (17)                                              /*!< USBH1_T::HcRhStatus: OCIC Position     */
#define USBH1_HcRhStatus_OCIC_Msk        (0x1ul << USBH1_HcRhStatus_OCIC_Pos)              /*!< USBH1_T::HcRhStatus: OCIC Mask         */

#define USBH1_HcRhStatus_CRWE_Pos        (31)                                              /*!< USBH1_T::HcRhStatus: CRWE Position     */
#define USBH1_HcRhStatus_CRWE_Msk        (0x1ul << USBH1_HcRhStatus_CRWE_Pos)              /*!< USBH1_T::HcRhStatus: CRWE Mask         */

#define USBH1_HcRhPortStatus_CCS_Pos     (0)                                               /*!< USBH1_T::HcRhPortStatus: CCS Position  */
#define USBH1_HcRhPortStatus_CCS_Msk     (0x1ul << USBH1_HcRhPortStatus_CCS_Pos)           /*!< USBH1_T::HcRhPortStatus: CCS Mask      */

