zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/hsusbh_reg.h
#define USBH1_HcRhPortStatus_PES_Pos     (1)                                               /*!< USBH1_T::HcRhPortStatus: PES Position  */
#define USBH1_HcRhPortStatus_PES_Msk     (0x1ul << USBH1_HcRhPortStatus_PES_Pos)           /*!< USBH1_T::HcRhPortStatus: PES Mask      */

#define USBH1_HcRhPortStatus_PSS_Pos     (2)                                               /*!< USBH1_T::HcRhPortStatus: PSS Position  */
#define USBH1_HcRhPortStatus_PSS_Msk     (0x1ul << USBH1_HcRhPortStatus_PSS_Pos)           /*!< USBH1_T::HcRhPortStatus: PSS Mask      */

#define USBH1_HcRhPortStatus_POCI_Pos    (3)                                               /*!< USBH1_T::HcRhPortStatus: POCI Position */
#define USBH1_HcRhPortStatus_POCI_Msk    (0x1ul << USBH1_HcRhPortStatus_POCI_Pos)          /*!< USBH1_T::HcRhPortStatus: POCI Mask     */

#define USBH1_HcRhPortStatus_PRS_Pos     (4)                                               /*!< USBH1_T::HcRhPortStatus: PRS Position  */
#define USBH1_HcRhPortStatus_PRS_Msk     (0x1ul << USBH1_HcRhPortStatus_PRS_Pos)           /*!< USBH1_T::HcRhPortStatus: PRS Mask      */

#define USBH1_HcRhPortStatus_PPS_Pos     (8)                                               /*!< USBH1_T::HcRhPortStatus: PPS Position  */
#define USBH1_HcRhPortStatus_PPS_Msk     (0x1ul << USBH1_HcRhPortStatus_PPS_Pos)           /*!< USBH1_T::HcRhPortStatus: PPS Mask      */

#define USBH1_HcRhPortStatus_LSDA_Pos    (9)                                               /*!< USBH1_T::HcRhPortStatus: LSDA Position */
#define USBH1_HcRhPortStatus_LSDA_Msk    (0x1ul << USBH1_HcRhPortStatus_LSDA_Pos)          /*!< USBH1_T::HcRhPortStatus: LSDA Mask     */

#define USBH1_HcRhPortStatus_CSC_Pos     (16)                                              /*!< USBH1_T::HcRhPortStatus: CSC Position  */
#define USBH1_HcRhPortStatus_CSC_Msk     (0x1ul << USBH1_HcRhPortStatus_CSC_Pos)           /*!< USBH1_T::HcRhPortStatus: CSC Mask      */

#define USBH1_HcRhPortStatus_PESC_Pos    (17)                                              /*!< USBH1_T::HcRhPortStatus: PESC Position */
#define USBH1_HcRhPortStatus_PESC_Msk    (0x1ul << USBH1_HcRhPortStatus_PESC_Pos)          /*!< USBH1_T::HcRhPortStatus: PESC Mask     */

#define USBH1_HcRhPortStatus_PSSC_Pos    (18)                                              /*!< USBH1_T::HcRhPortStatus: PSSC Position */
#define USBH1_HcRhPortStatus_PSSC_Msk    (0x1ul << USBH1_HcRhPortStatus_PSSC_Pos)          /*!< USBH1_T::HcRhPortStatus: PSSC Mask     */

#define USBH1_HcRhPortStatus_OCIC_Pos    (19)                                              /*!< USBH1_T::HcRhPortStatus: OCIC Position */
#define USBH1_HcRhPortStatus_OCIC_Msk    (0x1ul << USBH1_HcRhPortStatus_OCIC_Pos)          /*!< USBH1_T::HcRhPortStatus: OCIC Mask     */

#define USBH1_HcRhPortStatus_PRSC_Pos    (20)                                              /*!< USBH1_T::HcRhPortStatus: PRSC Position */
#define USBH1_HcRhPortStatus_PRSC_Msk    (0x1ul << USBH1_HcRhPortStatus_PRSC_Pos)          /*!< USBH1_T::HcRhPortStatus: PRSC Mask     */


/** @} HSUSBH_USBH1_CONST */
/** @} end of HSUSBH register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __HSUSBH_REG_H__ */
